# Напишите программу, которая по заданному номеру четверти,
# показывает диапазон возможных координат точек в этой четверти (x и y).

quarter_num = int(input("Введите номер четверти от 0 до 4: "))

if quarter_num > 4 or quarter_num <=0:
    print("Ошибка. Вы ввели недоупстимое значение. Введите значение 0 до 4." )
elif quarter_num == 1:
    print('Диапазон координат: Х = от "0" до "+ бесконечности"; Y = от "0" до "+ бесконечности."')
elif quarter_num == 2:
    print('Диапазон координат: Х = от "0" до "- бесконечности"; Y = от "0" до "+ бесконечности."')
elif quarter_num == 3:
    print('Диапазон координат: Х = от "0" до "- бесконечности"; Y = от "0" до "- бесконечности."')
elif quarter_num == 4:
    print('Диапазон координат: Х = от "0" до "+ бесконечности"; Y = от "0" до "- бесконечности."')
    